; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-61)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc2)
    (at car1 loc10)
    (at car2 loc3)
    (at car3 loc11)
    (at car4 loc11)
    (at car5 loc3)
    (at car6 loc7)
    (at car7 loc8)
    (at car8 loc8)
    (at car9 loc8)
    (at car10 loc8)
    (at car11 loc5)
    (at car12 loc4)
)
 (:goal (and 
(at car11 loc10)
))
)

; plan
1. (sail loc2 loc5)
   deleted: (at-ferry loc2)
   added: (at-ferry loc5)
   goals met: 0 of 1
2. (board car11 loc5)
   deleted: (at car11 loc5) (empty-ferry)
   added: (on car11)
   goals met: 0 of 1
3. (sail loc5 loc10)
   deleted: (at-ferry loc5)
   added: (at-ferry loc10)
   goals met: 0 of 1
4. (debark car11 loc10)
   deleted: (on car11)
   added: (at car11 loc10) (empty-ferry)
   goals met: 1 of 1
